### Note
* Instructions have been included for each segment. You do not have to follow them exactly, but they are included to help you think through the steps.

In [1]:
# Dependencies and Setup
import pandas as pd

# File to Load (Remember to Change These)
school_data_to_load = "Resources/schools_complete.csv"
student_data_to_load = "Resources/students_complete.csv"

## District Summary

* Calculate the total number of schools

* Calculate the total number of students

* Calculate the total budget

* Calculate the average math score 

* Calculate the average reading score

* Calculate the overall passing rate (overall average score), i.e. (avg. math score + avg. reading score)/2

* Calculate the percentage of students with a passing math score (70 or greater)

* Calculate the percentage of students with a passing reading score (70 or greater)

* Create a dataframe to hold the above results

* Optional: give the displayed data cleaner formatting

In [2]:
# Read School and Student Data File and store into Pandas Data Frames
school_data = pd.read_csv(school_data_to_load)
school_data.head()

   School ID            school_name      type  size   budget
0          0      Huang High School  District  2917  1910635
1          1   Figueroa High School  District  2949  1884411
2          2    Shelton High School   Charter  1761  1056600
3          3  Hernandez High School  District  4635  3022020
4          4    Griffin High School   Charter  1468   917500

In [3]:
student_data = pd.read_csv(student_data_to_load)
student_data.head()

,Student ID,student_name,gender,grade,school_name,reading_score,math_score
0,0,Paul Bradley,M,9th,Huang High School,66,79
1,1,Victor Smith,M,12th,Huang High School,94,61
2,2,Kevin Rodriguez,M,12th,Huang High School,90,60
3,3,Dr. Richard Scott,M,12th,Huang High School,67,58
4,4,Bonnie Ray,F,9th,Huang High School,97,84

In [4]:
# Combine the data into a single dataset
school_data_complete = pd.merge(student_data, school_data, how="left", on=["school_name", "school_name"])
school_data_complete.head()

,Student ID,student_name,gender,grade,school_name,reading_score,math_score,School ID,type,size,budget
0,0,Paul Bradley,M,9th,Huang High School,66,79,0,District,2917,1910635
1,1,Victor Smith,M,12th,Huang High School,94,61,0,District,2917,1910635
2,2,Kevin Rodriguez,M,12th,Huang High School,90,60,0,District,2917,1910635
3,3,Dr. Richard Scott,M,12th,Huang High School,67,58,0,District,2917,1910635
4,4,Bonnie Ray,F,9th,Huang High School,97,84,0,District,2917,1910635

In [5]:
# Calculate the total number of schools
# len(school_data)

total_schools = len(school_data)
total_schools

15

In [6]:
# Calculate the total number of students
# len(student_data)

total_students = len(student_data)
total_students

39170

In [7]:
# Identify incomplete rows - Schools
school_data.count()

School ID      15
school_name    15
type           15
size           15
budget         15
dtype: int64

In [8]:
school_data.dtypes

School ID       int64
school_name    object
type           object
size            int64
budget          int64
dtype: object

In [9]:
# Identify incomplete rows - Students
student_data.count()

Student ID       39170
student_name     39170
gender           39170
grade            39170
school_name      39170
reading_score    39170
math_score       39170
dtype: int64

In [10]:
student_data.dtypes

Student ID        int64
student_name     object
gender           object
grade            object
school_name      object
reading_score     int64
math_score        int64
dtype: object

In [11]:
# Calculate the total budget
Total_Budget= sum(school_data['budget'])
Total_Budget

24649428

In [12]:
# Calculate the average math score
Total_MathScore = sum(student_data['math_score'])
Total_MathScore

Avg_MathScore = (Total_MathScore / len(student_data))
Avg_MathScore

78.98537145774827

In [13]:
# Calculate the average reading score
Total_ReadingScore = sum(student_data['reading_score'])
Total_ReadingScore

Avg_ReadingScore = (Total_ReadingScore / len(student_data))
Avg_ReadingScore

81.87784018381414

In [14]:
# Calculate the overall passing rate (overall average score), 
# i.e. (avg. math score + avg. reading score)/2

# Avg_mScore = int(round(Avg_MathScore))
# Avg_mScore

# Avg_rScore = int(round(Avg_ReadingScore))
# Avg_rScore

# Overall_AvgScore = sum(Avg_mScore + Avg_rScore)
# Overall_AvgScore

Avg_0 = student_data.describe()
Avg_0

# Avg = sum(Avg_0.iloc[2,1] + Avg_0.iloc[2,2]) / 2

         Student ID  reading_score    math_score
count  39170.000000    39170.00000  39170.000000
mean   19584.500000       81.87784     78.985371
std    11307.549359       10.23958     12.309968
min        0.000000       63.00000     55.000000
25%     9792.250000       73.00000     69.000000
50%    19584.500000       82.00000     79.000000
75%    29376.750000       91.00000     89.000000
max    39169.000000       99.00000     99.000000

In [15]:
#  Calculate the percentage of students with a passing math score (70 or greater)

# student_data.max()
# student_data.min()
# student_data.describe()


#S_mPC = (student_data['math_score'] >= 70).count()
#S_mPC

#Student_mPC = percent(student_data )

math_pass_count = school_data_complete['math_score'][school_data_complete['math_score'] >= 70].count()
math_pass_percent = math_pass_count / total_students * 100
math_pass_percent

74.9808526933878

In [16]:
# Calculate the percentage of students with a passing reading score (70 or greater)

read_pass_count = school_data_complete['reading_score'][school_data_complete['reading_score'] >= 70].count()
read_pass_percent = read_pass_count / total_students * 100
read_pass_percent

85.80546336482001

In [17]:
# Create a dataframe to hold the above results

# District_Summary = pd.DataFrame({"Total Schools": total_schools, 

District_Summary = pd.DataFrame({"Total Schools": [total_schools], 
                       "Total Students": total_students, 
                       "Total Budget": Total_Budget, 
                       "Average Math Score": Avg_MathScore, 
                       "Average Reading Score":Avg_ReadingScore, 
                       "Avg Math Pass %":math_pass_percent, 
                       "Avg Reading Pass %": read_pass_percent})

District_Summary["Total Budget"] = District_Summary["Total Budget"].apply(format)
District_Summary

,Total Schools,Total Students,Total Budget,Average Math Score,Average Reading Score,Avg Math Pass %,Avg Reading Pass %
0,15,39170,24649428,78.985371,81.87784,74.980853,85.805463

In [18]:
# Optional: give the displayed data cleaner formatting

## School Summary

* Create an overview table that summarizes key metrics about each school, including:
  * School Name
  * School Type
  * Total Students
  * Total School Budget
  * Per Student Budget
  * Average Math Score
  * Average Reading Score
  * % Passing Math
  * % Passing Reading
  * Overall Passing Rate (Average of the above two)
  
* Create a dataframe to hold the above results

In [47]:
# school_data_complete
df_orig = school_data_complete

# df.rename(columns={'old_name': 'new_ name'}) | Selective renaming

df = df_orig.rename(columns={'type': 'School_Type'})
df

,Student ID,student_name,gender,grade,school_name,reading_score,math_score,School ID,School_Type,size,budget
0,0,Paul Bradley,M,9th,Huang High School,66,79,0,District,2917,1910635
1,1,Victor Smith,M,12th,Huang High School,94,61,0,District,2917,1910635
2,2,Kevin Rodriguez,M,12th,Huang High School,90,60,0,District,2917,1910635
3,3,Dr. Richard Scott,M,12th,Huang High School,67,58,0,District,2917,1910635
4,4,Bonnie Ray,F,9th,Huang High School,97,84,0,District,2917,1910635
...,...,...,...,...,...,...,...,...,...,...,...
39165,39165,Donna Howard,F,12th,Thomas High School,99,90,14,Charter,1635,1043130
39166,39166,Dawn Bell,F,10th,Thomas High School,95,70,14,Charter,1635,1043130
39167,39167,Rebecca Tanner,F,9th,Thomas High School,73,84,14,Charter,1635,1043130
39168,39168,Desiree Kidd,F,10th,Thomas High School,99,90,14,Charter,1635,1043130
39169,39169,Carolyn Jackson,F,11th,Thomas High School,95,75,14,Charter,1635,1043130

In [60]:
# Students per School Type
df_students_per_type = df["School_Type"].value_counts()
df_students_per_type

District    26976
Charter     12194
Name: School_Type, dtype: int64

In [62]:
# Group by
g_per_type = df.groupby(["School_Type"])
g_per_type.head()

,Student ID,student_name,gender,grade,school_name,reading_score,math_score,School ID,School_Type,size,budget
0,0,Paul Bradley,M,9th,Huang High School,66,79,0,District,2917,1910635
1,1,Victor Smith,M,12th,Huang High School,94,61,0,District,2917,1910635
2,2,Kevin Rodriguez,M,12th,Huang High School,90,60,0,District,2917,1910635
3,3,Dr. Richard Scott,M,12th,Huang High School,67,58,0,District,2917,1910635
4,4,Bonnie Ray,F,9th,Huang High School,97,84,0,District,2917,1910635
5866,5866,Jamie Montgomery,F,12th,Shelton High School,70,91,2,Charter,1761,1056600
5867,5867,Shannon Phillips,F,10th,Shelton High School,84,71,2,Charter,1761,1056600
5868,5868,Todd Barber,M,11th,Shelton High School,95,99,2,Charter,1761,1056600
5869,5869,Desiree King,F,12th,Shelton High School,76,95,2,Charter,1761,1056600
5870,5870,Melissa Roberts,F,10th,Shelton High School,71,82,2,Charter,1761,1056600

In [68]:
# Grouped with School name

g_per_school = df.groupby(["School_Type", "school_name"]).sum()

#g_per_school.head()
g_per_school

                                   Student ID  reading_score  math_score  \
School_Type school_name
Charter     Cabrera High School      31477307         156027      154329
            Griffin High School      19077394         123043      122360
            Holden High School        9846620          35789       35784
            Pena High School         22851829          80851       80654
            Shelton High School      11879706         147441      146796
            Thomas High School       62705520         137093      136389
            Wilson High School       33950493         191748      190115
            Wright High School       45243900         151119      150628
District    Bailey High School      101303896         403225      383393
            Figueroa High School     12949059         239335      226223
            Ford High School         99055935         221164      211184
            Hernandez High School    46090440         375131      358238
            Huang High School         4252986         236810      223528
            Johnson High School     154327815         385481      366942
            Rodriguez High School   112111965         322898      307294

                                   School ID      size       budget
School_Type school_name
Charter     Cabrera High School        11148   3452164   2009159448
            Griffin High School         5872   2155024   1346890000
            Holden High School          3416    182329    105933149
            Pena High School            8658    925444    563595396
            Shelton High School         3522   3101121   1860672600
            Thomas High School         22890   2673225   1705517550
            Wilson High School         11415   5212089   3012587442
            Wright High School         18000   3240000   1888920000
District    Bailey High School         34832  24760576  15549641728
            Figueroa High School        2949   8696601   5557128039
            Ford High School           35607   7502121   4831365924
            Hernandez High School      13905  21483225  14007062700
            Huang High School              0   8508889   5573322295
            Johnson High School        57132  22667121  14733628650
            Rodriguez High School      43989  15992001  10186904637

In [86]:

g_per_school = df.groupby(["School_Type", "school_name"]).sum()
#g_per_school.dtypes

g_c1 = g_per_school['Avg_mScore' = (math_score / size)]
g_c1
#g_stats = g_per_school('Avg_mScore','Avg_rScore')

SyntaxError: invalid syntax (<ipython-input-86-ea549f3f539c>, line 4)

In [77]:
# From above
# District_Summary = pd.DataFrame({"Total Schools": total_schools, 

District_Summary = pd.DataFrame({"Total Schools": [total_schools], 
                       "Total Students": total_students, 
                       "Total Budget": Total_Budget, 
                       "Average Math Score": Avg_MathScore, 
                       "Average Reading Score":Avg_ReadingScore, 
                       "Avg Math Pass %":math_pass_percent, 
                       "Avg Reading Pass %": read_pass_percent})

District_Summary["Total Budget"] = District_Summary["Total Budget"].apply(format)
District_Summary

,Total Schools,Total Students,Total Budget,Average Math Score,Average Reading Score,Avg Math Pass %,Avg Reading Pass %
0,15,39170,24649428,78.985371,81.87784,74.980853,85.805463

In [53]:
g = df.groupby('School_Type')['school_name']

for school_type, school_type_df, school_name, school_name_df in g_df:
    #print(school_name)
    #print(school_name_df)
    g.get_group(School_Type)
    g.get_group(School_Type, school_name)
    g.max()
    g.describe

# for school_name, g_df in 

# School_Summary = school_data_complete.groupby('school_name')

ValueError: not enough values to unpack (expected 4, got 2)

## Top Performing Schools (By Passing Rate)

* Sort and display the top five schools in overall passing rate

## Bottom Performing Schools (By Passing Rate)

* Sort and display the five worst-performing schools

## Math Scores by Grade

* Create a table that lists the average Reading Score for students of each grade level (9th, 10th, 11th, 12th) at each school.

  * Create a pandas series for each grade. Hint: use a conditional statement.
  
  * Group each series by school
  
  * Combine the series into a dataframe
  
  * Optional: give the displayed data cleaner formatting

## Reading Score by Grade

* Perform the same operations as above for reading scores

## Scores by School Spending

* Create a table that breaks down school performances based on average Spending Ranges (Per Student). Use 4 reasonable bins to group school spending. Include in the table each of the following:
  * Average Math Score
  * Average Reading Score
  * % Passing Math
  * % Passing Reading
  * Overall Passing Rate (Average of the above two)

In [56]:
# Sample bins. Feel free to create your own bins.
spending_bins = [0, 585, 615, 645, 675]
group_names = ["<$585", "$585-615", "$615-645", "$645-675"]

## Scores by School Size

* Perform the same operations as above, based on school size.

In [55]:
# Sample bins. Feel free to create your own bins.
size_bins = [0, 1000, 2000, 5000]
group_names = ["Small (<1000)", "Medium (1000-2000)", "Large (2000-5000)"]

## Scores by School Type

* Perform the same operations as above, based on school type.